Revit 2027 API
BarTerminationsData.TerminationRotationAngleAtEnd Property
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of bar.
The default value is 0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TerminationRotationAngleAtEnd { get; set; }
Public Property TerminationRotationAngleAtEnd As Double
	Get
	Set
public:
property double TerminationRotationAngleAtEnd {
	double get ();
	void set (double value);
}
member TerminationRotationAngleAtEnd : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for terminationRotationAngleAtEnd is not finite
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace